test/performance-test.yml
config:
  target: "http://localhost:3000"
  http:
    timeout: 300
  payload:
    path: 'random_urls.csv'
    fields:
      - 'url'
  phases:
    - name: "Begin"
      duration: 10  # Test duration in seconds
      arrivalRate: 1  # Number of users per second
    - name: "Steady"
      duration: 60
      arrivalRate: 100
    # - name: "Spike"
    #   duration: 20
    #   arrivalRate: 50
    #   rampTo: 200
    # - name: "Super Spike"
    #   duration: 20
    #   arrivalRate: 500
    #   rampTo: 2000
    # - name: "Rest"
    #   duration: 30
    #   arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/create?url={{url}}"
          capture:
            - json: "$.id"
              as: videoId
      - get:
          url: "/short/{{videoId}}"
          ifTrue: "videoId"
          followRedirect: false