test/performance-test.yml
config:
  target: "http://localhost:3000"
  http:
    timeout: 120
  payload:
    path: 'random_urls.csv'
    fields:
      - 'url'
    random: true
  phases:
    - name: "Begin"
      duration: 60  # Test duration in seconds
      arrivalRate: 30  # Number of users per second
    - pause: 10
    - name: "Rapid Ramp"
      duration: 20
      arrivalRate: 10
      rampTo: 200
    - name: "TOP"
      duration: 60
      arrivalRate: 200
    - name: "Ramp Down"
      duration: 20
      arrivalRate: 200
      rampTo: 10
    - name: "End"
      duration: 60
      arrivalRate: 5
scenarios:
  - flow:
      - post:
          url: "/create?url={{url}}"
          capture:
            - json: "$.id"
              as: "tempId"
      - get:
          url: "/short/{{tempId}}"
          ifTrue: "tempId"
          followRedirect: false