test/performance-test.yml
config:
  target: "http://localhost:3000" # Replace with your server's URL
  phases:
    - duration: 10  # Test duration in seconds
      arrivalRate: 1  # Number of users per second
scenarios:
  - flow:
      - get:
          url: "/"
      - post:
          url: "/create?url=https://youtu.be/rOpEN1JDaD0?si=DU4Shli9wUL65CaN"
          capture:
            - json: "$.id"
              as: videoId
      - get:
          url: "/short/{{videoId}}"
          capture:
            - json: "$.url"
              as: url