test/performance-test.yml
config:
  target: "http://localhost:3000" # Replace with your server's URL
  http:
    timeout: 300
  phases:
    - name: "Begin"
      duration: 10  # Test duration in seconds
      arrivalRate: 1  # Number of users per second
    - name: "Steady"
      duration: 100
      arrivalRate: 80
    #   rampTo: 500
    # - name: "Rest"
    #   duration: 30
    #   arrivalRate: 5

scenarios:
  - flow:
      - post:
          url: "/create?url=https://youtu.be/rOpEN1JDaD0?si=DU4Shli9wUL65CaN"
          capture:
            - json: "$.id"
              as: videoId
      - get:
          url: "/short/{{videoId}}"
          ifTrue: "videoId"
          followRedirect: false